
MM_RADIO_ROOM_ID = "tina_csj_mm_radio_room_id";

-- 3.20
MM_RADIO_BROADCASTER_LIST=
{
	[1] = {
		uin = 0;
		name = "暂无";
		
	};
	[2] = {
		uin = 0;
		name = "暂无";
		
	};
	[3] = {
		uin = 0;
		name = "暂无";
		
	};
	[4] = {
		uin = 0;
		name = "暂无";
		
	};
	[5] = {
		uin = 0;
		name = "暂无";
		
	};
	[6] = {
		uin = 0;
		name = "暂无";
		
	};
	[7] = {
		uin = 0;
		name = "暂无";
		
	};
	[8] = {
		uin = 0;
		name = "暂无";
		
	};
	[9] = {
		uin = 0;
		name = "暂无";
		
	};
	[10] = {
		uin = 0;
		name = "暂无";
		
	};
	[11] = {
		uin = 10100060;
		name = "白久";
		
	};
	[12] = {
		uin = 10100060;
		name = "白久";
		
	};
	[13] = {
		uin = 10100060;
		name = "白久";
		
	};
	[14] = {
		uin = 10100060;
		name = "白久";
		
	};
	[15] = {
		uin = 10100064;
		name = "Hero";
		
	};
	[16] = {
		uin = 10100061;
		name = "非";
		
	};
	[17] = {
		uin = 10100061;
		name = "非";
		
	};
	[18] = {
		uin = 10100061;
		name = "非";
	};
	[19] = {
		uin = 10100061;
		name = "非";
		
	};
	[20] = {
		uin = 10100061;
		name = "非";
		
	};
	[21] = {
		uin = 10100061;
		name = "非";
		
	};
	[22] = {
		uin = 10100061;
		name = "非";
		
	};
	[23] = {
		uin = 10100061;
		name = "非";
		
	};
	[24] = {
		uin = 10100061;
		name = "非";
	};
};

--[[
MM_RADIO_BROADCASTER_LIST=
{
	[1] = {
		uin = 0;
		name = "暂无";
		
	};
	[2] = {
		uin = 0;
		name = "暂无";
		
	};
	[3] = {
		uin = 0;
		name = "暂无";
		
	};
	[4] = {
		uin = 0;
		name = "暂无";
		
	};
	[5] = {
		uin = 0;
		name = "暂无";
		
	};
	[6] = {
		uin = 0;
		name = "暂无";
		
	};
	[7] = {
		uin = 0;
		name = "暂无";
		
	};
	[8] = {
		uin = 0;
		name = "暂无";
		
	};
	[9] = {
		uin = 0;
		name = "暂无";
		
	};
	[10] = {
		uin = 0;
		name = "暂无";
		
	};
	[11] = {
		uin = 10100060;
		name = "白久";
		
	};
	[12] = {
		uin = 10100060;
		name = "白久";
		
	};
	[13] = {
		uin = 10100060;
		name = "白久";
		
	};
	[14] = {
		uin = 10100060;
		name = "白久";
		
	};
	[15] = {
		uin = 10100062;
		name = "制作人";
		
	};
	[16] = {
		uin = 10100060;
		name = "白久";
		
	};
	[17] = {
		uin = 10100060;
		name = "白久";
		
	};
	[18] = {
		uin = 10100060;
		name = "白久";
	};
	[19] = {
		uin = 10100060;
		name = "白久";
		
	};
	[20] = {
		uin = 10100060;
		name = "白久";
		
	};
	[21] = {
		uin = 10100060;
		name = "白久";
		
	};
	[22] = {
		uin = 10100060;
		name = "白久";
		
	};
	[23] = {
		uin = 10100060;
		name = "白久";
		
	};
	[24] = {
		uin = 10100060;
		name = "白久";
	};
};
--]]