local Notice = 
{ 
	{
		CharState = 0;                --显示状态
		parm = 2;
		headline = "長生訣";    --主标题
		subhead = "首發上線";     --副标题
		content = "那年春，風絮中，柳下回眸正相逢，你戲說年少種種 剎那間溫柔心動，從此痴，跌入三生一場夢……..\n\n"..
"長生訣雙版本首發上線囉！我們特別準備了一連串的開服好禮活動等著大家參加與領取喔。\n\n"..
"1.【限時禮包大放送】不需花費任何一毛錢即可免費領取\n"..
"2.【登入豪禮】開服7天，每天登入拿好禮\n"..
"3.【天降元寶】完成相對應任務即可獲得大量綁元\n"..
"4.【寶箱大作戰】開服前七天參與副本(歸墟、秘境、鬼王陵)可额外獲得開服寶箱\n"..
"5.【限時探索遺跡】尋找NPC領取支線任務，並且達到相對應等級，就贈送免費探索遺跡之門喔。\n"..
"6.【醉臥長生】開服前七天野外菁英怪將會掉落”瓊漿玉露”，使用後可獲得稀有道具。\n\n"..
"遊戲內還有多樣化的活動等你一起來發掘，快來長生訣尋找你一生摯友以及一世所愛吧！\n\n"..
"再一世，煙雨裡，想起你淺笑眉低，再回望年少種種，那年剎那的心動，你是我 不曾圓滿的歡喜……";
		issue_time = "<color=#00ab37>發佈時間：</color>2017-04-11";    --发布时间
		hongdian_id = 1;	     --小红点id（不可重复）
	};
};
return Notice;